"""
用来存在一些重要初始变量,方便其他程序调用
"""

import numpy as np

# （这两个用来确定转换矩阵）
# 手眼标定结果rviz_end to cam，RPY角
euler_g = [0.0117479, -0.00672778, -0.0633768, 86.7564, -30.5705, -89.4876]
# end_to_rviz
end_to_rviz_g = np.array([[1.49577339e-17, 1.72624060e-16, -1.00000000e+00, 0],
                          [2.08352145e-16, -1.00000000e+00, -1.44058082e-16, 0],
                          [-1.00000000e+00, -2.39391840e-16, -1.11022302e-16, 0],
                          [0, 0, 0, 1]])  # 处于位置1

# 机械手在桌子上的位置
# initP_g = [180.695189, 399.452541, 260.479814, 89.257917, -60.547234, -88.43694]  # 第一次的位置(欧拉角度)
# initA_g = [44.247835, -15.610962, 43.182903, -207.333984, 46, 60.205078]  # 第一次的位置(角度)

# 机械臂在小车上的位置
initP_g = [-109, 240, 466, -90, 60, 0]  # 第一次的位置(欧拉角度)
initA_g = [90, -107, 126, -199, -90, -120]  # 第一次的位置(角度)---水平夹爪
